data 'BNDL' (128) {
	$"6D52 6544 0000 0001 4652 4546 0004 0000"            /* mReD....FREF.... */
	$"0080 0001 0081 0002 0082 0003 0083 0004"            /* .€......‚...ƒ.. */
	$"0084 4943 4E23 0004 0000 0080 0001 0000"            /* .„ICN#.....€.... */
	$"0002 0081 0003 0081 0004 0082"                      /* .........‚ */
};

data 'mReD' (0, "Owner resource") {
	$"00"                                                 /* . */
};

data 'FREF' (128) {
	$"4150 504C 0000 00"                                  /* APPL... */
};

data 'FREF' (129) {
	$"2A2A 2A2A 0001 00"                                  /* ****... */
};

data 'FREF' (130) {
	$"5445 5854 0002 00"                                  /* TEXT... */
};

data 'FREF' (131) {
	$"5758 4D45 0003 00"                                  /* WXME... */
};

data 'FREF' (132) {
	$"4D72 4170 0004 00"                                  /* MrAp... */
};

data 'ics8' (128) {
	$"0000 0000 00FF FFFF FFFF FF00 0000 0000"            /* .....ÿÿÿÿÿÿ..... */
	$"0000 00FF FFD2 D2D2 D2D2 D2FF FF00 0000"            /* ...ÿÿÒÒÒÒÒÒÿÿ... */
	$"0000 FF23 2300 00D2 D2D2 D2D2 D2FF 0000"            /* ..ÿ##..ÒÒÒÒÒÒÿ.. */
	$"00FF 2323 2323 2300 D2D2 D2D2 D2D2 FF00"            /* .ÿ#####.ÒÒÒÒÒÒÿ. */
	$"00FF 2323 2323 2300 00D2 D2D2 D2D2 FF00"            /* .ÿ#####..ÒÒÒÒÒÿ. */
	$"FF23 2323 2323 2323 00D2 D2D2 D2D2 D2FF"            /* ÿ#######.ÒÒÒÒÒÒÿ */
	$"FF23 2323 2323 2323 0000 D2D2 D2D2 D2FF"            /* ÿ#######..ÒÒÒÒÒÿ */
	$"FF23 2323 2323 2300 0000 D2D2 D2D2 D2FF"            /* ÿ######...ÒÒÒÒÒÿ */
	$"FF23 2323 2323 0000 2300 00D2 D2D2 D2FF"            /* ÿ#####..#..ÒÒÒÒÿ */
	$"FF23 2323 2323 0023 2323 00D2 D2D2 D2FF"            /* ÿ#####.###.ÒÒÒÒÿ */
	$"FF23 2323 2300 0023 2323 0000 D2D2 D2FF"            /* ÿ####..###..ÒÒÒÿ */
	$"00FF 2323 2300 2323 2323 2300 D2D2 FF00"            /* .ÿ###.#####.ÒÒÿ. */
	$"00FF 2323 0000 2323 2323 2300 00D2 FF00"            /* .ÿ##..#####..Òÿ. */
	$"0000 FF23 0023 2323 2323 2323 00FF 0000"            /* ..ÿ#.#######.ÿ.. */
	$"0000 00FF FF23 2323 2323 23FF FF00 0000"            /* ...ÿÿ######ÿÿ... */
	$"0000 0000 00FF FFFF FFFF FF00 0000 0000"            /* .....ÿÿÿÿÿÿ..... */
};

data 'ics8' (129) {
	$"00FF FFFF FFFF FFFF FFFF FFFF 0000 0000"            /* .ÿÿÿÿÿÿÿÿÿÿÿ.... */
	$"00FF 2B2B 2B2B 2B2B 2B2B 2BFF FF00 0000"            /* .ÿ+++++++++ÿÿ... */
	$"00FF 2B2B 2B2B 2B2B 2B2B 2BFF F9FF 0000"            /* .ÿ+++++++++ÿωÿ.. */
	$"00FF 2B2B 2B2B 2B2B 2B2B 2BFF FFFF FF00"            /* .ÿ+++++++++ÿÿÿÿ. */
	$"00FF 2B2B 2BFF FFFF FFFF FF2B 2B2B FF00"            /* .ÿ+++ÿÿÿÿÿÿ+++ÿ. */
	$"00FF 2B2B FFFF 2323 D2D2 FFFF 2B2B FF00"            /* .ÿ++ÿÿ##ÒÒÿÿ++ÿ. */
	$"00FF 2B2B FF23 2323 D2D2 D2FF 2B2B FF00"            /* .ÿ++ÿ###ÒÒÒÿ++ÿ. */
	$"00FF 2B2B FF23 2323 D2D2 D2FF 2B2B FF00"            /* .ÿ++ÿ###ÒÒÒÿ++ÿ. */
	$"00FF 2B2B FF23 2300 23D2 D2FF 2B2B FF00"            /* .ÿ++ÿ##.#ÒÒÿ++ÿ. */
	$"00FF 2B2B FF23 2323 23D2 D2FF 2B2B FF00"            /* .ÿ++ÿ####ÒÒÿ++ÿ. */
	$"00FF 2B2B FFFF 0023 2323 FFFF 2B2B FF00"            /* .ÿ++ÿÿ.###ÿÿ++ÿ. */
	$"00FF 2B2B 2BE0 FFFF FFFF FF2B 2B2B FF00"            /* .ÿ+++ΰÿÿÿÿÿ+++ÿ. */
	$"00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00"            /* .ÿ++++++++++++ÿ. */
	$"00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00"            /* .ÿ++++++++++++ÿ. */
	$"00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00"            /* .ÿ++++++++++++ÿ. */
	$"00FF FFFF FFFF FFFF FFFF FFFF FFFF FF00"            /* .ÿÿÿÿÿÿÿÿÿÿÿÿÿÿ. */
};

data 'ics8' (130) {
	$"0000 0000 00FF FFFF FFFF FF00 0000 0000"            /* .....ÿÿÿÿÿÿ..... */
	$"0000 00FF FFD2 D2D2 D2D2 D2FF FF00 0000"            /* ...ÿÿÒÒÒÒÒÒÿÿ... */
	$"0000 FF23 2300 00D2 D2D2 D2D2 D2FF 0000"            /* ..ÿ##..ÒÒÒÒÒÒÿ.. */
	$"00FF 2323 2323 2300 D2D2 D2D2 D2D2 FF00"            /* .ÿ#####.ÒÒÒÒÒÒÿ. */
	$"00FF 2323 2323 2300 00D2 D2D2 D2D2 FF00"            /* .ÿ#####..ÒÒÒÒÒÿ. */
	$"FF23 2323 2323 2323 00D2 D2D2 D2D2 D2FF"            /* ÿ#######.ÒÒÒÒÒÒÿ */
	$"FF23 2323 2323 2323 0000 D2D2 D2D2 D2FF"            /* ÿ#######..ÒÒÒÒÒÿ */
	$"FF23 2323 2323 2300 0000 D2D2 D2D2 D2FF"            /* ÿ######...ÒÒÒÒÒÿ */
	$"FF23 2323 2323 0000 2300 00D2 D2D2 D2FF"            /* ÿ#####..#..ÒÒÒÒÿ */
	$"FF23 2323 2323 0023 2323 00D2 D2D2 D2FF"            /* ÿ#####.###.ÒÒÒÒÿ */
	$"FF23 2323 2300 0023 2323 0000 D2D2 D2FF"            /* ÿ####..###..ÒÒÒÿ */
	$"00FF 2323 2300 2323 2323 2300 ECE3 FF00"            /* .ÿ###.#####.μγÿ. */
	$"00FF 2323 0000 2323 2323 E3E3 E3CB E300"            /* .ÿ##..####γγγΛγ. */
	$"0000 FF23 0023 2323 2323 E3CB CBCB CBE3"            /* ..ÿ#.#####γΛΛΛΛγ */
	$"0000 00FF FF23 2323 2323 E3E3 E3CB E300"            /* ...ÿÿ#####γγγΛγ. */
	$"0000 0000 00FF FFFF FFFF FF00 00E3 0000"            /* .....ÿÿÿÿÿÿ..γ.. */
};

data 'ics#' (128) {
	$"07E0 1FF8 39FC 7EFE 7E7E FF7F FF3F FE3F"            /* .ΰ.ψ9ό~ώ~~ÿ.ÿ?ώ? */
	$"FC9F FDDF F9CF 7BEE 73E6 37F4 1FF8 07E0"            /* όύίωΟ{ξsζ7τ.ψ.ΰ */
	$"07E0 1FF8 3FFC 7FFE 7FFE FFFF FFFF FFFF"            /* .ΰ.ψ?ό.ώ.ώÿÿÿÿÿÿ */
	$"FFFF FFFF FFFF 7FFE 7FFE 3FFC 1FF8 07E0"            /* ÿÿÿÿÿÿ.ώ.ώ?ό.ψ.ΰ */
};

data 'ics#' (129) {
	$"7FF0 4018 4014 401E 47E2 4FF2 4FF2 4FF2"            /* .π@.@.@.GβOςOςOς */
	$"4EF2 4FF2 4DF2 47E2 4002 4002 4002 7FFE"            /* NςOςMςGβ@.@.@..ώ */
	$"7FF0 7FF8 7FFC 7FFE 7FFE 7FFE 7FFE 7FFE"            /* .π.ψ.ό.ώ.ώ.ώ.ώ.ώ */
	$"7FFE 7FFE 7FFE 7FFE 7FFE 7FFE 7FFE 7FFE"            /* .ώ.ώ.ώ.ώ.ώ.ώ.ώ.ώ */
};

data 'ics#' (130) {
	$"07E0 1FF8 39FC 7EFE 7E7E FF7F FF3F FE3F"            /* .ΰ.ψ9ό~ώ~~ÿ.ÿ?ώ? */
	$"FC9F FDDF F9CF 7BEE 73FA 37E1 1FFA 07E4"            /* όύίωΟ{ξsϊ7α.ϊ.δ */
	$"07E0 1FF8 3FFC 7FFE 7FFE FFFF FFFF FFFF"            /* .ΰ.ψ?ό.ώ.ώÿÿÿÿÿÿ */
	$"FFFF FFFF FFFF 7FFE 7FFE 3FFF 1FFE 07E4"            /* ÿÿÿÿÿÿ.ώ.ώ?ÿ.ώ.δ */
};

data 'ics4' (128) {
	$"0000 0FFF FFF0 0000 000F F666 666F F000"            /* ...ÿÿπ....φffoπ. */
	$"00F3 3006 6666 6F00 0F33 3330 6666 66F0"            /* .σ0.ffo..330fffπ */
	$"0F33 3330 0666 66F0 F333 3333 0666 666F"            /* .330.ffπσ333.ffo */
	$"F333 3333 0066 666F F333 3330 0066 666F"            /* σ333.ffoσ330.ffo */
	$"F333 3300 3006 666F F333 3303 3306 666F"            /* σ33.0.foσ33.3.fo */
	$"F333 3003 3300 666F 0F33 3033 3330 66F0"            /* σ30.3.fo.30330fπ */
	$"0F33 0033 3330 06F0 00F3 0333 3333 0F00"            /* .3.330.π.σ.333.. */
	$"000F F333 333F F000 0000 0FFF FFF0 0000"            /* ..σ33?π....ÿÿπ.. */
};

data 'ics4' (129) {
	$"0FFF FFFF FFFF 0000 0FCC CCCC CCCF F000"            /* .ÿÿÿÿÿ...ΜΜΜΜΟπ. */
	$"0FCC CCCC CCCF DF00 0FCC CCCC CCCF FFF0"            /* .ΜΜΜΜΟί..ΜΜΜΜΟÿπ */
	$"0FCC CFFF FFFC CCF0 0FCC FF33 66FF CCF0"            /* .ΜΟÿÿόΜπ.Μÿ3fÿΜπ */
	$"0FCC F333 666F CCF0 0FCC F333 666F CCF0"            /* .Μσ3foΜπ.Μσ3foΜπ */
	$"0FCC F330 366F CCF0 0FCC F333 366F CCF0"            /* .Μσ06oΜπ.Μσ36oΜπ */
	$"0FCC FF03 33FF CCF0 0FCC CFFF FFFC CCF0"            /* .Μÿ.3ÿΜπ.ΜΟÿÿόΜπ */
	$"0FCC CCCC CCCC CCF0 0FCC CCCC CCCC CCF0"            /* .ΜΜΜΜΜΜπ.ΜΜΜΜΜΜπ */
	$"0FCC CCCC CCCC CCF0 0FFF FFFF FFFF FFF0"            /* .ΜΜΜΜΜΜπ.ÿÿÿÿÿÿπ */
};

data 'ics4' (130) {
	$"0000 0FFF FFF0 0000 000F F666 666F F000"            /* ...ÿÿπ....φffoπ. */
	$"00F3 3006 6666 6F00 0F33 3330 6666 66F0"            /* .σ0.ffo..330fffπ */
	$"0F33 3330 0666 66F0 F333 3333 0666 666F"            /* .330.ffπσ333.ffo */
	$"F333 3333 0066 666F F333 3330 0066 666F"            /* σ333.ffoσ330.ffo */
	$"F333 3300 3006 666F F333 3303 3306 666F"            /* σ33.0.foσ33.3.fo */
	$"F333 3003 3300 666F 0F33 3033 3330 68F0"            /* σ30.3.fo.30330hπ */
	$"0F33 0033 3388 8980 00F3 0333 3389 9998"            /* .3.33‰€.σ.33‰™ */
	$"000F F333 3388 8980 0000 0FFF FFF0 0800"            /* ..σ33‰€...ÿÿπ.. */
};

data 'icl4' (128) {
	$"0000 0000 0000 00CC CC00 0000 0000 0000"            /* .......ΜΜ....... */
	$"0000 0000 00CE FF66 6665 DC00 0000 0000"            /* .....Ξÿffeά..... */
	$"0000 0000 DEDC 00CE 6666 665C 0000 0000"            /* ....ήά.Ξfff\.... */
	$"0000 00CE EBBB D000 5666 6666 E000 0000"            /* ...Ξλ»Π.Vfffΰ... */
	$"0000 0C33 3333 3C00 C666 6666 65C0 0000"            /* ...333<.Ζfffeΐ.. */
	$"0000 C333 3333 3300 0566 6666 666C 0000"            /* ..Γ3333..ffffl.. */
	$"000C 3333 3333 33C0 0D66 6666 666E 0000"            /* ..33333ΐ.ffffn.. */
	$"000E 3333 3333 33B0 0C66 6666 6666 D000"            /* ..33333°.fffffΠ. */
	$"00D3 3333 3333 3330 0056 6666 6666 6C00"            /* .Σ333330.Vffffl. */
	$"0033 3333 3333 333C 00D6 6666 6666 6500"            /* .333333<.Φffffe. */
	$"0C33 3333 3333 333C 00C6 6666 6666 66C0"            /* .333333<.Ζfffffΐ */
	$"0B33 3333 3333 333C 0005 6666 6666 66D0"            /* .333333<..fffffΠ */
	$"0333 3333 3333 333C 000C 6666 6666 6650"            /* .333333<..fffffP */
	$"C333 3333 3333 3330 C000 6666 6666 6660"            /* Γ3333330ΐ.fffff` */
	$"C333 3333 3333 33DB 3C00 D666 6666 666C"            /* Γ333333Ϋ<.Φffffl */
	$"D333 3333 3333 33C3 3B00 C666 6666 666C"            /* Σ333333Γ;.Ζffffl */
	$"D333 3333 3333 3BD3 3300 0566 6666 666C"            /* Σ33333;Σ3..ffffl */
	$"C333 3333 3333 3CB3 33D0 0C66 6666 6660"            /* Γ33333<³3Π.ffff` */
	$"C333 3333 3333 DC33 33B0 0066 6666 6660"            /* Γ33333ά33°.ffff` */
	$"0333 3333 3333 0B33 333C 00D6 6666 6650"            /* .33333.33<.ΦfffP */
	$"0B33 3333 333D C333 333B 0006 6666 66D0"            /* .3333=Γ33;..fffΠ */
	$"0C33 3333 33B0 B333 3333 000D 6666 66C0"            /* .3333°³333..fffΐ */
	$"0033 3333 33C0 3333 3333 D000 6666 6E00"            /* .3333ΐ3333Π.ffn. */
	$"00D3 3333 3E0D 3333 3333 B000 D666 6C00"            /* .Σ33>.3333°.Φfl. */
	$"000E 3333 3C0B 3333 3333 3C00 0666 D000"            /* ..33<.3333<..fΠ. */
	$"000C 3333 B0C3 3333 3333 3D00 0D6E 0000"            /* ..33°Γ3333=..n.. */
	$"0000 C333 00B3 3333 3333 3300 00FC 0000"            /* ..Γ3.³33333..ό.. */
	$"0000 0C3D 0C33 3333 3333 33C0 CEC0 0000"            /* ...=.333333ΐΞΐ.. */
	$"0000 00CE A333 3333 3333 33BE E000 0000"            /* ...Ξ£333333Ύΰ... */
	$"0000 0000 CB33 3333 3333 33EC 0000 0000"            /* ....Λ333333μ.... */
	$"0000 0000 00CB 3333 333B BC00 0000 0000"            /* .....Λ333;Ό..... */
	$"0000 0000 0000 00CC CC00 0000 0000 0000"            /* .......ΜΜ....... */
};

data 'icl4' (129) {
	$"000F FFFF FFFF FFFF FFFF FFF0 0000 0000"            /* ..ÿÿÿÿÿÿÿÿÿπ.... */
	$"000F CCCC CCCC CCCC CCCC CCFF 0000 0000"            /* ..ΜΜΜΜΜΜΜΜΜÿ.... */
	$"000F CCCC CCCC CCCC CCCC CCFD F000 0000"            /* ..ΜΜΜΜΜΜΜΜΜύπ... */
	$"000F CCCC CCCC CCCC CCCC CCFD DF00 0000"            /* ..ΜΜΜΜΜΜΜΜΜύί... */
	$"000F CCCC CCCC CCCC CCCC CCFD DDF0 0000"            /* ..ΜΜΜΜΜΜΜΜΜύέπ.. */
	$"000F CCCC CCCC CCCC CCCC CCFD DDDF 0000"            /* ..ΜΜΜΜΜΜΜΜΜύέί.. */
	$"000F CCCC CCCC CCCC CCCC CCFF FFFF F000"            /* ..ΜΜΜΜΜΜΜΜΜÿÿÿπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F CCCC CCCC CFFF FFFC CCCC CCCC F000"            /* ..ΜΜΜΜΟÿÿόΜΜΜΜπ. */
	$"000F CCCC CCCF F666 666F FCCC CCCC F000"            /* ..ΜΜΜΟφffoόΜΜΜπ. */
	$"000F CCCC CCF3 3006 6666 6FCC CCCC F000"            /* ..ΜΜΜσ0.ffoΜΜΜπ. */
	$"000F CCCC CF33 3330 6666 66FC CCCC F000"            /* ..ΜΜΟ330fffόΜΜπ. */
	$"000F CCCC CF33 3330 0666 66FC CCCC F000"            /* ..ΜΜΟ330.ffόΜΜπ. */
	$"000F CCCC F333 3333 0666 666F CCCC F000"            /* ..ΜΜσ333.ffoΜΜπ. */
	$"000F CCCC F333 3333 0066 666F CCCC F000"            /* ..ΜΜσ333.ffoΜΜπ. */
	$"000F CCCC F333 3330 0066 666F CCCC F000"            /* ..ΜΜσ330.ffoΜΜπ. */
	$"000F CCCC F333 3300 3006 666F CCCC F000"            /* ..ΜΜσ33.0.foΜΜπ. */
	$"000F CCCC F333 3303 3306 666F CCCC F000"            /* ..ΜΜσ33.3.foΜΜπ. */
	$"000F CCCC F333 3003 3300 666F CCCC F000"            /* ..ΜΜσ30.3.foΜΜπ. */
	$"000F CCCC CF33 3033 3330 66FC CCCC F000"            /* ..ΜΜΟ30330fόΜΜπ. */
	$"000F CCCC CF33 0033 3330 06FC CCCC F000"            /* ..ΜΜΟ3.330.όΜΜπ. */
	$"000F CCCC CCF3 0333 3333 0FCC CCCC F000"            /* ..ΜΜΜσ.333.ΜΜΜπ. */
	$"000F CCCC CCCF F333 333F FCCC CCCC F000"            /* ..ΜΜΜΟσ33?όΜΜΜπ. */
	$"000F CCCC CCCC CFFF FFFC CCCC CCCC F000"            /* ..ΜΜΜΜΟÿÿόΜΜΜΜπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F CCCC CCCC CCCC CCCC CCCC CCCC F000"            /* ..ΜΜΜΜΜΜΜΜΜΜΜΜπ. */
	$"000F FFFF FFFF FFFF FFFF FFFF FFFF F000"            /* ..ÿÿÿÿÿÿÿÿÿÿÿÿπ. */
};

data 'icl4' (130) {
	$"0000 0000 000F FFFF FFFF F000 0000 0000"            /* ......ÿÿÿÿπ..... */
	$"0000 0000 0FF6 6666 6666 6FF0 0000 0000"            /* .....φffffoπ.... */
	$"0000 000F FFFF FFF6 6666 666F F000 0000"            /* ....ÿÿÿφfffoπ... */
	$"0000 00F3 3F00 000F 6666 6666 6F00 0000"            /* ...σ?...ffffo... */
	$"0000 0F33 33FF F000 F666 6666 66F0 0000"            /* ...33ÿπ.φffffπ.. */
	$"0000 F333 3333 3F00 F666 6666 666F 0000"            /* ..σ333?.φffffo.. */
	$"000F 3333 3333 3F00 0F66 6666 6666 F000"            /* ..3333?..fffffπ. */
	$"00F3 3333 3333 33F0 0F66 6666 6666 6F00"            /* .σ33333π.fffffo. */
	$"00F3 3333 3333 33F0 00F6 6666 6666 6F00"            /* .σ33333π.φffffo. */
	$"0F33 3333 3333 333F 00F6 6666 6666 66F0"            /* .333333?.φfffffπ */
	$"0F33 3333 3333 333F 000F 6666 6666 66F0"            /* .333333?..fffffπ */
	$"F333 3333 3333 333F 000F 6666 6666 666F"            /* σ333333?..fffffo */
	$"F333 3333 3333 333F 0000 F666 6666 666F"            /* σ333333?..φffffo */
	$"F333 3333 3333 333F 0000 F666 6666 666F"            /* σ333333?..φffffo */
	$"F333 3333 3333 33F0 0F00 0F66 6666 666F"            /* σ333333π...ffffo */
	$"F333 3333 3333 33F0 FF00 0F66 6666 666F"            /* σ333333πÿ..ffffo */
	$"F333 3333 3333 3F00 F3F0 00F6 6666 666F"            /* σ33333?.σπ.φfffo */
	$"F333 3333 3333 3F0F 33F0 00F6 6666 666F"            /* σ33333?.3π.φfffo */
	$"F333 3333 3333 F00F 33F0 000F 6666 666F"            /* σ33333π.3π..fffo */
	$"F333 3333 3333 F0F3 333F 000F 6666 666F"            /* σ33333πσ3?..fffo */
	$"F333 3333 333F 00F3 333F 0000 F666 666F"            /* σ3333?.σ3?..φffo */
	$"0F33 3333 333F 0F33 3333 F000 F666 66F0"            /* .3333?.333π.φffπ */
	$"0F33 3333 33F0 0F33 3333 F000 0F66 66F0"            /* .3333π.333π..ffπ */
	$"00F3 3333 33F0 F333 3333 3F00 0F88 FF00"            /* .σ333πσ333?..ÿ. */
	$"00F3 3333 3F00 F333 3333 3F00 0089 8F00"            /* .σ33?.σ333?..‰. */
	$"000F 3333 3F0F 3333 3333 3888 8889 9800"            /* ..33?.33338‰. */
	$"0000 F333 F00F 3333 3333 3899 9999 9980"            /* ..σ3π.33338™™™™€ */
	$"0000 0F33 F0F3 3333 3333 3899 9999 9998"            /* ...3πσ33338™™™™ */
	$"0000 00FF FFF3 3333 3333 3899 9999 9980"            /* ...ÿÿσ33338™™™™€ */
	$"0000 000F FF33 3333 3333 3888 8889 9800"            /* ....ÿ333338‰. */
	$"0000 0000 0FF3 3333 3333 33FF 0089 8000"            /* .....σ33333ÿ.‰€. */
	$"0000 0000 000F FFFF FFFF FF00 0088 0000"            /* ......ÿÿÿÿÿ.... */
};

data 'icl8' (128) {
	$"0000 0000 0000 0000 0000 0000 00F5 2BF7"            /* .............υ+χ */
	$"F7F7 F500 0000 0000 0000 0000 0000 0000"            /* χχυ............. */
	$"0000 0000 0000 0000 0000 F8FB F2F1 D4EB"            /* ..........ψϋςρΤλ */
	$"ECD3 EEAA 802B 0000 0000 0000 0000 0000"            /* μΣξª€+.......... */
	$"0000 0000 0000 0000 56FB FAF7 F5F5 F7AB"            /* ........Vϋϊχυυχ« */
	$"D2D2 D2D2 D2D3 AAF7 0000 0000 0000 0000"            /* ÒÒÒÒÒΣªχ........ */
	$"0000 0000 0000 F688 885D 6464 F900 00F5"            /* ......φ]ddω..υ */
	$"AAD2 D2D2 D2D2 D2D3 FBF5 0000 0000 0000"            /* ªÒÒÒÒÒÒΣϋυ...... */
	$"0000 0000 00F7 6B23 2323 2323 D9F7 0000"            /* .....χk#####Ωχ.. */
	$"F7D3 D2D2 D2D2 D2D2 D2AA F600 0000 0000"            /* χΣÒÒÒÒÒÒÒªφ..... */
	$"0000 0000 F7DA 2323 2323 2323 23DB 0000"            /* ....χΪ#######Ϋ.. */
	$"00AA D2D2 D2D2 D2D2 D2D2 D4F6 0000 0000"            /* .ªÒÒÒÒÒÒÒÒΤφ.... */
	$"0000 00F6 6B23 2323 2323 2323 23D8 F800"            /* ...φk########Ψψ. */
	$"00F9 D2D2 D2D2 D2D2 D2D2 D2AB 0000 0000"            /* .ωÒÒÒÒÒÒÒÒÒ«.... */
	$"0000 0088 2323 2323 2323 2323 2323 6400"            /* ...##########d. */
	$"00F6 EED2 D2D2 D2D2 D2D2 D2D2 8000 0000"            /* .φξÒÒÒÒÒÒÒÒÒ€... */
	$"0000 56D8 2323 2323 2323 2323 2323 6B00"            /* ..VΨ##########k. */
	$"0000 AAD2 D2D2 D2D2 D2D2 D2D2 D32B 0000"            /* ..ªÒÒÒÒÒÒÒÒÒΣ+.. */
	$"0000 DB23 2323 2323 2323 2323 2323 472B"            /* ..Ϋ###########G+ */
	$"0000 F9D2 D2D2 D2D2 D2D2 D2D2 D2AA 0000"            /* ..ωÒÒÒÒÒÒÒÒÒÒª.. */
	$"00F8 D723 2323 2323 2323 2323 2323 D7F8"            /* .ψΧ###########Χψ */
	$"0000 F6EE D2D2 D2D2 D2D2 D2D2 D2ED 2B00"            /* ..φξÒÒÒÒÒÒÒÒÒν+. */
	$"0064 2323 2323 2323 2323 2323 2323 D7F8"            /* .d############Χψ */
	$"0000 00AA D2D2 D2D2 D2D2 D2D2 D2D2 FA00"            /* ...ªÒÒÒÒÒÒÒÒÒÒϊ. */
	$"006B 2323 2323 2323 2323 2323 2323 D9F6"            /* .k############Ωφ */
	$"0000 00F8 ECD2 D2D2 D2D2 D2D2 D2D2 AA00"            /* ...ψμÒÒÒÒÒÒÒÒÒª. */
	$"F6D9 2323 2323 2323 2323 2323 2323 DB00"            /* φΩ############Ϋ. */
	$"F600 0000 D4D2 D2D2 D2D2 D2D2 D2D2 D400"            /* φ...ΤÒÒÒÒÒÒÒÒÒΤ. */
	$"F7D7 2323 2323 2323 2323 2323 2323 FA5D"            /* χΧ############ϊ] */
	$"DBF6 0000 FAD2 D2D2 D2D2 D2D2 D2D2 EDF6"            /* Ϋφ..ϊÒÒÒÒÒÒÒÒÒνφ */
	$"56D7 2323 2323 2323 2323 2323 23DA 2B6B"            /* VΧ###########Ϊ+k */
	$"235D 0000 F6ED D2D2 D2D2 D2D2 D2D2 D32B"            /* #]..φνÒÒÒÒÒÒÒÒΣ+ */
	$"56D7 2323 2323 2323 2323 2323 235D F9D7"            /* VΧ###########]ωΧ */
	$"236B F500 00AA D2D2 D2D2 D2D2 D2D2 D32B"            /* #kυ..ªÒÒÒÒÒÒÒÒΣ+ */
	$"F7D8 2323 2323 2323 2323 2323 6BF6 6423"            /* χΨ##########kφd# */
	$"2323 F900 00F8 EBD2 D2D2 D2D2 D2D2 EEF5"            /* ##ω..ψλÒÒÒÒÒÒÒξυ */
	$"F6D9 2323 2323 2323 2323 23D7 FAF8 D823"            /* φΩ#########ΧϊψΨ# */
	$"2323 6400 0000 EFD2 D2D2 D2D2 D2D2 D400"            /* ##d...οÒÒÒÒÒÒÒΤ. */
	$"006B 2323 2323 2323 2323 23DB 0064 2323"            /* .k#########Ϋ.d## */
	$"2323 47F7 0000 F9EB D2D2 D2D2 D2D2 AA00"            /* ##Gχ..ωλÒÒÒÒÒÒª. */
	$"0064 2323 2323 2323 2323 D856 F6DA 2323"            /* .d########ΨVφΪ## */
	$"2323 235D 0000 00D4 D2D2 D2D2 D2D2 8000"            /* ###]...ΤÒÒÒÒÒÒ€. */
	$"00F8 D823 2323 2323 2323 6400 5D23 2323"            /* .ψΨ#######d.]### */
	$"2323 236B F500 00F9 EBD2 D2D2 D2ED 2B00"            /* ###kυ..ωλÒÒÒÒν+. */
	$"0000 DB23 2323 2323 2347 F7F5 6B23 2323"            /* ..Ϋ######Gχυk### */
	$"2323 23D7 5600 00F5 D4D2 D2D2 D2AB 0000"            /* ###ΧV..υΤÒÒÒÒ«.. */
	$"0000 56D8 2323 2323 2388 00F9 D723 2323"            /* ..VΨ#####.ωΧ### */
	$"2323 2323 6400 0000 F9EB D2D2 ED2B 0000"            /* ####d...ωλÒÒν+.. */
	$"0000 0088 2323 2323 DA2B 0064 2323 2323"            /* ...####Ϊ+.d#### */
	$"2323 2323 D9F6 0000 F5EF D2D2 8000 0000"            /* ####Ωφ..υοÒÒ€... */
	$"0000 00F6 6B23 2323 5D00 F7D8 2323 2323"            /* ...φk###].χΨ#### */
	$"2323 2323 23FA 0000 00FA D2AB 0000 0000"            /* #####ϊ...ϊÒ«.... */
	$"0000 0000 F7DA 236B F500 6423 2323 2323"            /* ....χΪ#kυ.d##### */
	$"2323 2323 23DB 0000 00F5 F2F6 0000 0000"            /* #####Ϋ...υςφ.... */
	$"0000 0000 00F7 DB56 00F7 D923 2323 2323"            /* .....χΫV.χΩ##### */
	$"2323 2323 2347 F700 F7FB F600 0000 0000"            /* #####Gχ.χϋφ..... */
	$"0000 0000 0000 F6FC 8FD9 2323 2323 2323"            /* ......φόΩ###### */
	$"2323 2323 2323 64FC FB00 0000 0000 0000"            /* ######dόϋ....... */
	$"0000 0000 0000 0000 F864 4723 2323 2323"            /* ........ψdG##### */
	$"2323 2323 2347 88F7 0000 0000 0000 0000"            /* #####Gχ........ */
	$"0000 0000 0000 0000 0000 F75D DBDA 47D7"            /* ..........χ]ΫΪGΧ */
	$"D747 6B64 5D2B 0000 0000 0000 0000 0000"            /* ΧGkd]+.......... */
	$"0000 0000 0000 0000 0000 0000 00F5 2B2B"            /* .............υ++ */
	$"2B2B 0000 0000 0000 0000 0000 0000 0000"            /* ++.............. */
};

data 'icl8' (129) {
	$"0000 00FF FFFF FFFF FFFF FFFF FFFF FFFF"            /* ...ÿÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF FFFF FF00 0000 0000 0000 0000"            /* ÿÿÿÿÿÿÿ......... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B FFFF 0000 0000 0000 0000"            /* ++++++ÿÿ........ */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B FFF9 FF00 0000 0000 0000"            /* ++++++ÿωÿ....... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B FFF9 F9FF 0000 0000 0000"            /* ++++++ÿωωÿ...... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B FFF9 F9F9 FF00 0000 0000"            /* ++++++ÿωωωÿ..... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B FFF9 F9F9 F9FF 0000 0000"            /* ++++++ÿωωωωÿ.... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B FFFF FFFF FFFF FF00 0000"            /* ++++++ÿÿÿÿÿÿÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2BFF FFFF"            /* ...ÿ+++++++++ÿÿÿ */
	$"FFFF FF2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ÿÿÿ+++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2BFF FFD2 D2D2"            /* ...ÿ+++++++ÿÿÒÒÒ */
	$"D2D2 D2FF FF2B 2B2B 2B2B 2B2B FF00 0000"            /* ÒÒÒÿÿ+++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B FF23 2300 00D2"            /* ...ÿ++++++ÿ##..Ò */
	$"D2D2 D2D2 D2FF 2B2B 2B2B 2B2B FF00 0000"            /* ÒÒÒÒÒÿ++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2BFF 2323 2323 2300"            /* ...ÿ+++++ÿ#####. */
	$"D2D2 D2D2 D2D2 FF2B 2B2B 2B2B FF00 0000"            /* ÒÒÒÒÒÒÿ+++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2BFF 2323 2323 2300"            /* ...ÿ+++++ÿ#####. */
	$"00D2 D2D2 D2D2 FF2B 2B2B 2B2B FF00 0000"            /* .ÒÒÒÒÒÿ+++++ÿ... */
	$"0000 00FF 2B2B 2B2B FF23 2323 2323 2323"            /* ...ÿ++++ÿ####### */
	$"00D2 D2D2 D2D2 D2FF 2B2B 2B2B FF00 0000"            /* .ÒÒÒÒÒÒÿ++++ÿ... */
	$"0000 00FF 2B2B 2B2B FF23 2323 2323 2323"            /* ...ÿ++++ÿ####### */
	$"0000 D2D2 D2D2 D2FF 2B2B 2B2B FF00 0000"            /* ..ÒÒÒÒÒÿ++++ÿ... */
	$"0000 00FF 2B2B 2B2B FF23 2323 2323 2300"            /* ...ÿ++++ÿ######. */
	$"0000 D2D2 D2D2 D2FF 2B2B 2B2B FF00 0000"            /* ..ÒÒÒÒÒÿ++++ÿ... */
	$"0000 00FF 2B2B 2B2B FF23 2323 2323 0000"            /* ...ÿ++++ÿ#####.. */
	$"2300 00D2 D2D2 D2FF 2B2B 2B2B FF00 0000"            /* #..ÒÒÒÒÿ++++ÿ... */
	$"0000 00FF 2B2B 2B2B FF23 2323 2323 0023"            /* ...ÿ++++ÿ#####.# */
	$"2323 00D2 D2D2 D2FF 2B2B 2B2B FF00 0000"            /* ##.ÒÒÒÒÿ++++ÿ... */
	$"0000 00FF 2B2B 2B2B FF23 2323 2300 0023"            /* ...ÿ++++ÿ####..# */
	$"2323 0000 D2D2 D2FF 2B2B 2B2B FF00 0000"            /* ##..ÒÒÒÿ++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2BFF 2323 2300 2323"            /* ...ÿ+++++ÿ###.## */
	$"2323 2300 D2D2 FF2B 2B2B 2B2B FF00 0000"            /* ###.ÒÒÿ+++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2BFF 2323 0000 2323"            /* ...ÿ+++++ÿ##..## */
	$"2323 2300 00D2 FF2B 2B2B 2B2B FF00 0000"            /* ###..Òÿ+++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B FF23 0023 2323"            /* ...ÿ++++++ÿ#.### */
	$"2323 2323 00FF 2B2B 2B2B 2B2B FF00 0000"            /* ####.ÿ++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2BFF FF23 2323"            /* ...ÿ+++++++ÿÿ### */
	$"2323 23FF FF2B 2B2B 2B2B 2B2B FF00 0000"            /* ###ÿÿ+++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2BFF FFFF"            /* ...ÿ+++++++++ÿÿÿ */
	$"FFFF FF2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ÿÿÿ+++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF 2B2B 2B2B 2B2B 2B2B 2B2B 2B2B"            /* ...ÿ++++++++++++ */
	$"2B2B 2B2B 2B2B 2B2B 2B2B 2B2B FF00 0000"            /* ++++++++++++ÿ... */
	$"0000 00FF FFFF FFFF FFFF FFFF FFFF FFFF"            /* ...ÿÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF FFFF FFFF FFFF FFFF FF00 0000"            /* ÿÿÿÿÿÿÿÿÿÿÿÿÿ... */
};

data 'icl8' (130) {
	$"0000 0000 0000 0000 0000 00FF FFFF FFFF"            /* ...........ÿÿÿÿÿ */
	$"FFFF FFFF FF00 0000 0000 0000 0000 0000"            /* ÿÿÿÿÿ........... */
	$"0000 0000 0000 0000 00FF FFEC ECEC ECEC"            /* .........ÿÿμμμμμ */
	$"ECEC ECEC ECFF FF00 0000 0000 0000 0000"            /* μμμμμÿÿ......... */
	$"0000 0000 0000 00FF FFFF FFFF FFFF FFEC"            /* .......ÿÿÿÿÿÿÿÿμ */
	$"ECEC ECEC ECEC ECFF FF00 0000 0000 0000"            /* μμμμμμμÿÿ....... */
	$"0000 0000 0000 FFD8 D8FF 0000 0000 00FF"            /* ......ÿΨΨÿ.....ÿ */
	$"ECEC ECEC ECEC ECEC ECFF 0000 0000 0000"            /* μμμμμμμμμÿ...... */
	$"0000 0000 00FF D8D8 D8D8 FFFF FF00 0000"            /* .....ÿΨΨΨΨÿÿÿ... */
	$"FFEC ECEC ECEC ECEC ECEC FF00 0000 0000"            /* ÿμμμμμμμμμÿ..... */
	$"0000 0000 FFD8 D8D8 D8D8 D8D8 D8FF 0000"            /* ....ÿΨΨΨΨΨΨΨΨÿ.. */
	$"FFEC ECEC ECEC ECEC ECEC ECFF 0000 0000"            /* ÿμμμμμμμμμμÿ.... */
	$"0000 00FF D8D8 D8D8 D8D8 D8D8 D8FF 0000"            /* ...ÿΨΨΨΨΨΨΨΨΨÿ.. */
	$"00FF ECEC ECEC ECEC ECEC ECEC FF00 0000"            /* .ÿμμμμμμμμμμÿ... */
	$"0000 FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 FF00"            /* ..ÿΨΨΨΨΨΨΨΨΨΨΨÿ. */
	$"00FF ECEC ECEC ECEC ECEC ECEC ECFF 0000"            /* .ÿμμμμμμμμμμμÿ.. */
	$"0000 FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 FF00"            /* ..ÿΨΨΨΨΨΨΨΨΨΨΨÿ. */
	$"0000 FFEC ECEC ECEC ECEC ECEC ECFF 0000"            /* ..ÿμμμμμμμμμμÿ.. */
	$"00FF D8D8 D8D8 D8D8 D8D8 D8D8 D8D8 D8FF"            /* .ÿΨΨΨΨΨΨΨΨΨΨΨΨΨÿ */
	$"0000 FFEC ECEC ECEC ECEC ECEC ECEC FF00"            /* ..ÿμμμμμμμμμμμÿ. */
	$"00FF D8D8 D8D8 D8D8 D8D8 D8D8 D8D8 D8FF"            /* .ÿΨΨΨΨΨΨΨΨΨΨΨΨΨÿ */
	$"0000 00FF ECEC ECEC ECEC ECEC ECEC FF00"            /* ...ÿμμμμμμμμμμÿ. */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 D8D8 D8FF"            /* ÿΨΨΨΨΨΨΨΨΨΨΨΨΨΨÿ */
	$"0000 00FF ECEC ECEC ECEC ECEC ECEC ECFF"            /* ...ÿμμμμμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 D8D8 D8FF"            /* ÿΨΨΨΨΨΨΨΨΨΨΨΨΨΨÿ */
	$"0000 0000 FFEC ECEC ECEC ECEC ECEC ECFF"            /* ....ÿμμμμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 D8D8 D8FF"            /* ÿΨΨΨΨΨΨΨΨΨΨΨΨΨΨÿ */
	$"0000 0000 FFEC ECEC ECEC ECEC ECEC ECFF"            /* ....ÿμμμμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 D8D8 FF00"            /* ÿΨΨΨΨΨΨΨΨΨΨΨΨΨÿ. */
	$"00FF 0000 00FF ECEC ECEC ECEC ECEC ECFF"            /* .ÿ...ÿμμμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 D8D8 FF00"            /* ÿΨΨΨΨΨΨΨΨΨΨΨΨΨÿ. */
	$"FFFF 0000 00FF ECEC ECEC ECEC ECEC ECFF"            /* ÿÿ...ÿμμμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 D8FF 0000"            /* ÿΨΨΨΨΨΨΨΨΨΨΨΨÿ.. */
	$"FFD8 FF00 0000 FFEC ECEC ECEC ECEC ECFF"            /* ÿΨÿ...ÿμμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 D8FF 00FF"            /* ÿΨΨΨΨΨΨΨΨΨΨΨΨÿ.ÿ */
	$"D8D8 FF00 0000 FFEC ECEC ECEC ECEC ECFF"            /* ΨΨÿ...ÿμμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 FF00 00FF"            /* ÿΨΨΨΨΨΨΨΨΨΨΨÿ..ÿ */
	$"D8D8 FF00 0000 00FF ECEC ECEC ECEC ECFF"            /* ΨΨÿ....ÿμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8D8 FF00 FFD8"            /* ÿΨΨΨΨΨΨΨΨΨΨΨÿ.ÿΨ */
	$"D8D8 D8FF 0000 00FF ECEC ECEC ECEC ECFF"            /* ΨΨΨÿ...ÿμμμμμμμÿ */
	$"FFD8 D8D8 D8D8 D8D8 D8D8 D8FF 0000 FFD8"            /* ÿΨΨΨΨΨΨΨΨΨΨÿ..ÿΨ */
	$"D8D8 D8FF 0000 0000 FFEC ECEC ECEC ECFF"            /* ΨΨΨÿ....ÿμμμμμμÿ */
	$"00FF D8D8 D8D8 D8D8 D8D8 D8FF 00FF D8D8"            /* .ÿΨΨΨΨΨΨΨΨΨÿ.ÿΨΨ */
	$"D8D8 D8D8 FF00 0000 FFEC ECEC ECEC FF00"            /* ΨΨΨΨÿ...ÿμμμμμÿ. */
	$"00FF D8D8 D8D8 D8D8 D8D8 FF00 00FF D8D8"            /* .ÿΨΨΨΨΨΨΨΨÿ..ÿΨΨ */
	$"D8D8 D8D8 FF00 0000 00FF ECEC ECEC FF00"            /* ΨΨΨΨÿ....ÿμμμμÿ. */
	$"0000 FFD8 D8D8 D8D8 D8D8 FF00 FFD8 D8D8"            /* ..ÿΨΨΨΨΨΨΨÿ.ÿΨΨΨ */
	$"D8D8 D8D8 D8FF 0000 00FF E3E3 FFFF 0000"            /* ΨΨΨΨΨÿ...ÿγγÿÿ.. */
	$"0000 FFD8 D8D8 D8D8 D8FF 0000 FFD8 D8D8"            /* ..ÿΨΨΨΨΨΨÿ..ÿΨΨΨ */
	$"D8D8 D8D8 D8FF 0000 0000 E3CB E3FF 0000"            /* ΨΨΨΨΨÿ....γΛγÿ.. */
	$"0000 00FF D8D8 D8D8 D8FF 00FF D8D8 D8D8"            /* ...ÿΨΨΨΨΨÿ.ÿΨΨΨΨ */
	$"D8D8 D8D8 D8E3 E3E3 E3E3 E3CB CBE3 0000"            /* ΨΨΨΨΨγγγγγγΛΛγ.. */
	$"0000 0000 FFD8 D8D8 FF00 00FF D8D8 D8D8"            /* ....ÿΨΨΨÿ..ÿΨΨΨΨ */
	$"D8D8 D8D8 D8E3 CBCB CBCB CBCB CBCB E300"            /* ΨΨΨΨΨγΛΛΛΛΛΛΛΛγ. */
	$"0000 0000 00FF D8D8 FF00 FFD8 D8D8 D8D8"            /* .....ÿΨΨÿ.ÿΨΨΨΨΨ */
	$"D8D8 D8D8 D8E3 CBCB CBCB CBCB CBCB CBE3"            /* ΨΨΨΨΨγΛΛΛΛΛΛΛΛΛγ */
	$"0000 0000 0000 FFFF FFFF FFD8 D8D8 D8D8"            /* ......ÿÿÿÿÿΨΨΨΨΨ */
	$"D8D8 D8D8 D8E3 CBCB CBCB CBCB CBCB E300"            /* ΨΨΨΨΨγΛΛΛΛΛΛΛΛγ. */
	$"0000 0000 0000 00FF FFFF D8D8 D8D8 D8D8"            /* .......ÿÿÿΨΨΨΨΨΨ */
	$"D8D8 D8D8 D8E3 E3E3 E3E3 E3CB CBE3 0000"            /* ΨΨΨΨΨγγγγγγΛΛγ.. */
	$"0000 0000 0000 0000 00FF FFD8 D8D8 D8D8"            /* .........ÿÿΨΨΨΨΨ */
	$"D8D8 D8D8 D8D8 FFFF 0000 E3CB E300 0000"            /* ΨΨΨΨΨΨÿÿ..γΛγ... */
	$"0000 0000 0000 0000 0000 00FF FFFF FFFF"            /* ...........ÿÿÿÿÿ */
	$"FFFF FFFF FFFF 0000 0000 E3E3 0000 0000"            /* ÿÿÿÿÿÿ....γγ.... */
};

data 'ICN#' (128) {
	$"001F F800 0075 5600 01FE AB80 0341 5540"            /* ..ψ..uV..ώ«€.AU@ */
	$"06B8 AAA0 0D54 D550 1AAC 6AA8 3556 5554"            /* .Έª .TΥP.¬j¨5VUT */
	$"2AAA 2AAC 5555 3556 6AAB 1AAA D555 1555"            /* *ª*¬UU5Vj«.ªΥU.U */
	$"AAAB 0AAB D555 0D55 AAAA 46AB D556 C555"            /* ª«Β«ΥU.UªªF«ΥVΕU */
	$"AAAC A2AB D555 6355 AAA9 A1AB D55B 5155"            /* ª¬Ά«ΥUcUª©΅«Υ[QU */
	$"AAB2 B0AB 5555 58D6 6AA6 A86A 356D 5854"            /* ª²°«UUXΦj¦¨j5mXT */
	$"2ACA AC2C 1555 5438 0A9A AC30 05B5 5620"            /* *Κ¬,.UT8Β¬0.µV  */
	$"03EA ABC0 01D5 5580 006A AE00 001F F800"            /* .κ«ΐ.ΥU€.j®...ψ. */
	$"001F F800 007F FE00 01FF FF80 03FF FFC0"            /* ..ψ...ώ..ÿÿ€.ÿÿΐ */
	$"07FF FFE0 0FFF FFF0 1FFF FFF8 3FFF FFFC"            /* .ÿÿΰ.ÿÿπ.ÿÿψ?ÿÿό */
	$"3FFF FFFC 7FFF FFFE 7FFF FFFE FFFF FFFF"            /* ?ÿÿό.ÿÿώ.ÿÿώÿÿÿÿ */
	$"FFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFF"            /* ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFF"            /* ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF 7FFF FFFE 7FFF FFFE 3FFF FFFC"            /* ÿÿÿÿ.ÿÿώ.ÿÿώ?ÿÿό */
	$"3FFF FFFC 1FFF FFF8 0FFF FFF0 07FF FFE0"            /* ?ÿÿό.ÿÿψ.ÿÿπ.ÿÿΰ */
	$"03FF FFC0 01FF FF80 007F FE00 001F F800"            /* .ÿÿΐ.ÿÿ€..ώ...ψ. */
};

data 'ICN#' (129) {
	$"1FFF FE00 1000 0300 1000 0280 1000 0240"            /* .ÿώ........€...@ */
	$"1000 0220 1000 0210 1000 03F8 1000 0008"            /* ... .......ψ.... */
	$"1007 E008 101F F808 1039 FC08 107E FE08"            /* ..ΰ...ψ..9ό..~ώ. */
	$"107E 7E08 10FF 7F08 10FF 3F08 10FE 3F08"            /* .~~..ÿ...ÿ?..ώ?. */
	$"10FC 9F08 10FD DF08 10F9 CF08 107B EE08"            /* .ό..ύί..ωΟ..{ξ. */
	$"1073 E608 1037 F408 101F F808 1007 E008"            /* .sζ..7τ...ψ...ΰ. */
	$"1000 0008 1000 0008 1000 0008 1000 0008"            /* ................ */
	$"1000 0008 1000 0008 1000 0008 1FFF FFF8"            /* .............ÿÿψ */
	$"1FFF FE00 1FFF FF00 1FFF FF80 1FFF FFC0"            /* .ÿώ..ÿÿ..ÿÿ€.ÿÿΐ */
	$"1FFF FFE0 1FFF FFF0 1FFF FFF8 1FFF FFF8"            /* .ÿÿΰ.ÿÿπ.ÿÿψ.ÿÿψ */
	$"1FFF FFF8 1FFF FFF8 1FFF FFF8 1FFF FFF8"            /* .ÿÿψ.ÿÿψ.ÿÿψ.ÿÿψ */
	$"1FFF FFF8 1FFF FFF8 1FFF FFF8 1FFF FFF8"            /* .ÿÿψ.ÿÿψ.ÿÿψ.ÿÿψ */
	$"1FFF FFF8 1FFF FFF8 1FFF FFF8 1FFF FFF8"            /* .ÿÿψ.ÿÿψ.ÿÿψ.ÿÿψ */
	$"1FFF FFF8 1FFF FFF8 1FFF FFF8 1FFF FFF8"            /* .ÿÿψ.ÿÿψ.ÿÿψ.ÿÿψ */
	$"1FFF FFF8 1FFF FFF8 1FFF FFF8 1FFF FFF8"            /* .ÿÿψ.ÿÿψ.ÿÿψ.ÿÿψ */
	$"1FFF FFF8 1FFF FFF8 1FFF FFF8 1FFF FFF8"            /* .ÿÿψ.ÿÿψ.ÿÿψ.ÿÿψ */
};

data 'ICN#' (130) {
	$"001F F800 0075 5600 01FE AB80 0341 5540"            /* ..ψ..uV..ώ«€.AU@ */
	$"06B8 AAA0 0D54 D550 1AAC 6AA8 3556 5554"            /* .Έª .TΥP.¬j¨5VUT */
	$"2AAA 2AAC 5555 3556 6AAB 1AAA D555 1555"            /* *ª*¬UU5Vj«.ªΥU.U */
	$"AAAB 0AAB D555 0D55 AAAA 46AB D556 C555"            /* ª«Β«ΥU.UªªF«ΥVΕU */
	$"AAAC A2AB D555 6355 AAA9 A1AB D55B 5155"            /* ª¬Ά«ΥUcUª©΅«Υ[QU */
	$"AAB2 B0AB 5555 58D6 6AA6 A86A 356D 547C"            /* ª²°«UUXΦj¦¨j5mT| */
	$"2ACA AC2C 1555 57E4 0A9A AC02 05B5 5401"            /* *Κ¬,.UWδΒ¬..µT. */
	$"03EA AC02 01D5 57E4 006A AB28 001F FC30"            /* .κ¬..ΥWδ.j«(..ό0 */
	$"001F F800 007F FE00 01FF FF80 03FF FFC0"            /* ..ψ...ώ..ÿÿ€.ÿÿΐ */
	$"07FF FFE0 0FFF FFF0 1FFF FFF8 3FFF FFFC"            /* .ÿÿΰ.ÿÿπ.ÿÿψ?ÿÿό */
	$"3FFF FFFC 7FFF FFFE 7FFF FFFE FFFF FFFF"            /* ?ÿÿό.ÿÿώ.ÿÿώÿÿÿÿ */
	$"FFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFF"            /* ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFF"            /* ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF 7FFF FFFE 7FFF FFFE 3FFF FFFC"            /* ÿÿÿÿ.ÿÿώ.ÿÿώ?ÿÿό */
	$"3FFF FFFC 1FFF FFFC 0FFF FFFE 07FF FFFF"            /* ?ÿÿό.ÿÿό.ÿÿώ.ÿÿÿ */
	$"03FF FFFE 01FF FFFC 007F FF38 001F FC30"            /* .ÿÿώ.ÿÿό..ÿ8..ό0 */
};

data 'cfrg' (0) {
	$"0000 0000 0000 0000 0000 0001 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0001"            /* ................ */
	$"7077 7063 0000 0000 0000 0000 0000 0000"            /* pwpc............ */
	$"0008 0000 0000 0101 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0030 046D 5265 4400"            /* .........0.mReD. */
};

data 'SIZE' (-1) {
	$"58F0 02FA F080 0098 9680"                           /* Xπ.ϊπ€.–€ */
};

